In [1]:
#조건으로 검색하기 
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [2]:
df = pd.DataFrame(np.random.rand(5,2), columns=["A","B"])
df

          A         B
0  0.137366  0.963656
1  0.835236  0.176162
2  0.979519  0.538973
3  0.474198  0.205608
4  0.297031  0.156116

In [3]:
print(df["A"])
print()
print(df["A"] < 0.5)
print()

0    0.137366
1    0.835236
2    0.979519
3    0.474198
4    0.297031
Name: A, dtype: float64

0     True
1    False
2    False
3     True
4     True
Name: A, dtype: bool

In [4]:
#조건으로 검색 

print(df[(df["A"] < 0.5) & (df["B"] > 0.3)])  #1번

c = (df["A"] < 0.5) & (df["B"] > 0.3) #2번
print(df[c])

print(df.query("A < 0.5 and B > 0.3")) #3번

          A         B
0  0.137366  0.963656
          A         B
0  0.137366  0.963656
          A         B
0  0.137366  0.963656

In [5]:
#문자열 조건 

data = {
	'Animal' : ['Dog','Cat','Cat','Pig','Cat'],
	'Name' : ['Happy','Sam','Toby','Mini','Rocky']
}

In [6]:
data

{'Animal': ['Dog', 'Cat', 'Cat', 'Pig', 'Cat'],
 'Name': ['Happy', 'Sam', 'Toby', 'Mini', 'Rocky']}

In [7]:
df = pd.DataFrame(data)
df

  Animal   Name
0    Dog  Happy
1    Cat    Sam
2    Cat   Toby
3    Pig   Mini
4    Cat  Rocky

In [8]:
df["Animal"].str.contains("Cat")

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [9]:
df[df["Animal"].str.contains("Cat")]

  Animal   Name
1    Cat    Sam
2    Cat   Toby
4    Cat  Rocky

In [10]:
df['Animal']

0    Dog
1    Cat
2    Cat
3    Pig
4    Cat
Name: Animal, dtype: object

In [11]:
df["Animal"].str.contains("cat", case=False) #case= 대소문자 상관없음

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [12]:
df.Animal.str.match("cat",case=False)

0    False
1     True
2     True
3    False
4     True
Name: Animal, dtype: bool

In [13]:
#함수로 데이터 처리하기 
#apply() : 함수를 받아서 적용 

df = pd.DataFrame(np.arange(5), columns=['Num'])

def square(x):
    return x**2
print(df)
print()
print(df["Num"])

df["Num"].apply(square)

   Num
0    0
1    1
2    2
3    3
4    4

0    0
1    1
2    2
3    3
4    4
Name: Num, dtype: int32

0     0
1     1
2     4
3     9
4    16
Name: Num, dtype: int64

In [14]:
#새 열 생성 >> 기존 데이터 프레임에 삽입
df['square'] = df["Num"].apply(square)
print(df)

   Num  square
0    0       0
1    1       1
2    2       4
3    3       9
4    4      16

In [15]:
df["Square_lambda"] = df.Num.apply(lambda x: x**2)
print(df)

   Num  square  Square_lambda
0    0       0              0
1    1       1              1
2    2       4              4
3    3       9              9
4    4      16             16

In [16]:
#함수로 데이터 처리하기 

df = pd.DataFrame(columns=['phone'])
df.loc[0] = "010-1234-5678"
df.loc[1] = "공일공-일이삼사-오육칠팔"
df.loc[2] = "010.1234.오육칠팔"
df.loc[3] = "공1공-1234-5육7팔"
df["pp"] = ''

In [17]:
df

           phone pp
0  010-1234-5678
1  공일공-일이삼사-오육칠팔
2  010.1234.오육칠팔
3  공1공-1234-5육7팔

In [20]:
def gpp(phone):
    m_dict = {
		"공" : "0",
		"일" : "1",
		"이" : "2",
		"삼" : "3",
		"사" : "4",
		"오" : "5",
		"육" : "6",
		"칠" : "7",
		"팔" : "8",
		"-"  : "",
		"."  : "",
}
    
    for key, value in m_dict.items():
    	phone = phone.replace(key, value)
    return phone

In [21]:
df["preprocess_phone"] = df["phone"].apply(
gpp)

In [22]:
df

           phone pp preprocess_phone
0  010-1234-5678         01012345678
1  공일공-일이삼사-오육칠팔         01012345678
2  010.1234.오육칠팔         01012345678
3  공1공-1234-5육7팔         01012345678

In [24]:
data = {
	'Sex' : ['Male','Male','Female','Female','Male']
}

In [25]:
df = pd.DataFrame(data)
df

      Sex
0    Male
1    Male
2  Female
3  Female
4    Male

In [29]:
df2 =df.Sex.replace({"Male": 0, "Female": 1})
df3 =df.Sex.replace({"Male": 0, "Female": 1}, inplace=True)

In [32]:
df

   Sex
0    0
1    0
2    1
3    1
4    0

In [36]:
#그룹으로 묶기 
#조건부로 집계하고 싶은 경우 

df =pd.DataFrame({'key': ['A','B','C','A','B','C'],
              'data' : range(6)})
print(df)

df.groupby('key')

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [35]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [38]:
df.groupby(['key','data']).sum()

Empty DataFrame
Columns: []
Index: [(A, 0), (A, 3), (B, 1), (B, 4), (C, 2), (C, 5)]

In [50]:
#aggregate
#groupby를 통해서 집계를 한번에 계산하는 방법 

df = pd.DataFrame({"data1": [0,1,2,3,4,5], 
                   "data2": [4,4,6,0,6,1],
                   "key" : ["A","B","C","A","B","C"]})
df

   data1  data2 key
0      0      4   A
1      1      4   B
2      2      6   C
3      3      0   A
4      4      6   B
5      5      1   C

In [48]:
df.groupby('key').aggregate(['min', np.median, max])

C:\Users\Master\AppData\Local\Temp\ipykernel_15988\960770304.py:1: FutureWarning: The provided callable <function median at 0x000001A28F460B80> is currently using SeriesGroupBy.median. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "median" instead.
  df.groupby('key').aggregate(['min', np.median, max])
C:\Users\Master\AppData\Local\Temp\ipykernel_15988\960770304.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('key').aggregate(['min', np.median, max])

    data1            data2
      min median max   min median max
key
A       0    1.5   3     0    2.0   4
B       1    2.5   4     4    5.0   6
C       2    3.5   5     1    3.5   6

In [49]:
df.groupby('key').aggregate({'data1': 'min', 'data2': np.sum})

C:\Users\Master\AppData\Local\Temp\ipykernel_15988\3756916842.py:1: FutureWarning: The provided callable <function sum at 0x000001A28F2CFF60> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.groupby('key').aggregate({'data1': 'min', 'data2': np.sum})

     data1  data2
key
A        0      4
B        1     10
C        2      7